Revit 2027 API
FabricationAncillaryUsage.UsageType Property
 Fabrication ancillary usage type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricationAncillaryUsageType UsageType { get; }
Public ReadOnly Property UsageType As FabricationAncillaryUsageType
	Get
public:
property FabricationAncillaryUsageType UsageType {
	FabricationAncillaryUsageType get ();
}
member UsageType : FabricationAncillaryUsageType with get
Property Value
FabricationAncillaryUsageType
See Also
Reference
FabricationAncillaryUsage Class
Autodesk.Revit.DB Namespace